docs/zsh-rc.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ZShell Resources Startup File</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="ZShell Resources Startup File"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-04T22:09-0800"/>
<meta name="author" content="Howard Abrams"/>
<meta name="description" content="Functions, aliases and other resources for ZShell"/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href='http://www.howardism.org/styles/org-export-html-style.css' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">ZShell Resources Startup File</h1>

<p>This startup file is loaded for <i>interactive</i> shells, so most of the
things here are for callable functions, aliases and the like.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Key Bindings</h2>
<div class="outline-text-2" id="text-1">


<p>
  On the Mac, open up the Terminal preferences, under your <code>Basic</code>
  settings, select the <code>Keyboard</code> tab and select the checkbox for
  <code>Use option as meta key</code> to take avantage of these.
</p>



<pre class="src src-sh">bindkey -e
</pre>


<p>
  <code>Meta-u</code> to chdir to the parent directory and then display the contents.
</p>



<pre class="src src-sh">bindkey -s <span style="color: #70c0b1;">'\eu'</span> <span style="color: #70c0b1;">'^Ucd ..; ls^M'</span>
</pre>


<p>
  Since <code>AUTO_PUSHD</code> is set, <code>Meta-p</code> pops the dir stack
</p>



<pre class="src src-sh">bindkey -s <span style="color: #70c0b1;">'\ep'</span> <span style="color: #70c0b1;">'^Upopd &gt;/dev/null; dirs -v^M'</span>
</pre>


<p>
  Pipe the current command through less with <code>Meta-l</code>
</p>



<pre class="src src-sh">bindkey -s <span style="color: #70c0b1;">"\el"</span> <span style="color: #70c0b1;">" 2&gt;&amp;1|less^M"</span>
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Modules</h2>
<div class="outline-text-2" id="text-2">


<p>
  Using the modules from <a href="https://github.com/robbyrussell/oh-my-zsh">Oh My Zsh</a>. 
  The plugins are in <code>~/.oh-my-zsh/plugins/*</code>
</p>



<pre class="src src-sh"><span style="color: #e7c547;">plugins</span>=(osx terminalapp gnu-utils git lein npm)
</pre>


<p>
  I use <a href="http://mxcl.github.com/homebrew/">Homebrew</a> on my home computers, but <a href="http://www.macports.org">MacPorts</a> at work.
  We will check to see which is installed, and then add that
  completion module:
</p>



<pre class="src src-sh"><span style="color: #b9ca4a;">if</span> [[ -f /usr/local/Cellar ]]
<span style="color: #b9ca4a;">then</span>
    <span style="color: #e7c547;">plugins</span>+=(homebrew)
<span style="color: #b9ca4a;">else</span>
    <span style="color: #e7c547;">plugins</span>+=(macports)
<span style="color: #b9ca4a;">fi</span>
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Oh My Zsh</h2>
<div class="outline-text-2" id="text-3">


<p>
  Load up the modules and other goodies from Oh my Zsh.
</p>



<pre class="src src-sh"><span style="color: #c397d8;">source</span> $<span style="color: #e7c547;">ZSH</span>/oh-my-zsh.sh
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">My Functions</h2>
<div class="outline-text-2" id="text-4">


<p>
  Load up my <a href="sh-functions.html">shared functions</a>. 
  These can be shared with Bash.
</p>



<pre class="src src-sh"><span style="color: #b9ca4a;">if</span> [[ -f $<span style="color: #e7c547;">HOME</span>/.sh-funcs.sh ]]
<span style="color: #b9ca4a;">then</span>
    <span style="color: #c397d8;">source</span> $<span style="color: #e7c547;">HOME</span>/.sh-funcs.sh
<span style="color: #b9ca4a;">fi</span>
</pre>


<p>
  Each machine I'm on (work or home), may have some special functions
  or aliases, so let's load anything that begins with <code>.zshrc-</code>:
</p>



<pre class="src src-sh"><span style="color: #b9ca4a;">for</span> SH_FILE<span style="color: #b9ca4a;"> in</span> $<span style="color: #e7c547;">HOME</span>/.zshrc-*
<span style="color: #b9ca4a;">do</span>
  <span style="color: #c397d8;">source</span> $<span style="color: #e7c547;">SH_FILE</span>
<span style="color: #b9ca4a;">done</span>
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Technical Gunk</h2>
<div class="outline-text-2" id="text-5">


<p>
  The following are the tangled settings. Type: <code>C-c C-v t</code>
  to create the script file.
</p>

</div>
</div>
</div>

</body>
</html>
